function setup() {
  createCanvas(600, 400);
}

function draw() {
fill(20, 180, 130);   // 보라색
stroke(120, 60, 160); // 테두리도 동일 색
rect(0, 0, width, height)
  
  // ===== 몬스터볼 =====

  // 윗 반원(빨간색)
fill(230, 0, 0);
stroke(0); strokeWeight(7);
arc(110, 80, 120, 120, PI, TWO_PI, CHORD);

  // 아래 반원(흰색)
  fill(255);
  stroke(0); strokeWeight(7);
  arc(110, 80, 120, 120, 0, PI, CHORD);

  // 가운데 검은 띠
  stroke(0); strokeWeight(0);
  line(53, 80, 113, 80);

  // 버튼(검은 링 + 흰 원)
  noStroke(); fill(0);
  ellipse(110, 80, 35, 35);    // 검은 테
  stroke(0); strokeWeight(0.3); fill(255);
  ellipse(110, 80, 25, 25);    // 흰 버튼
  
  
  // ===== 문양 =====
  
  // 물방울
  fill(120, 200, 255);
  stroke(30, 140, 200);
  strokeWeight(0)

  // 위쪽 삼각형 (꼭짓점 위, 밑변이 가운데 라인)
  triangle(435, 30, 405, 70, 465, 70);

  // 아래쪽 반원(약간 더 둥글게 하고 싶으면 h*0.8 등으로 조절)
  arc(435, 70, 60, 75, 0, PI, CHORD);
  
  // 땅 문양
  fill(210, 120, 40);
  stroke(140, 80, 30);
  strokeWeight(1)
  quad(480, 100, 495, 60, 505, 60, 490, 100)
  quad(500, 100, 520, 40, 550, 40, 570, 100)
  
  // ===== 몸통 =====
  fill(160, 220, 255);
  stroke(90, 160, 200);
  strokeWeight();
  rect(220, 160, 160, 160);   // 직사각형
  arc(300, 160, 160, 160, PI, TWO_PI, CHORD); // 위 반원(머리)
  
  // ===== 몸통 아래쪽 호 =====
  // 몸통보다 조금 넓은 곡선(호) → 더 자연스러운 둥근 밑부분
  fill(160, 220, 255);
  stroke(90, 160, 200);
  strokeWeight();
  arc(300, 320, 160, 60, 0, PI, CHORD);

  // ===== 얼굴 =====
  // 눈
  noStroke(); fill(35, 70, 100);
  ellipse(250, 130, 5, 5);
  ellipse(350, 130, 5, 5);

  // 콧구멍
  ellipse(295, 155, 4, 4);
  ellipse(305, 155, 4, 4);

  // 입 (몸통보다 약간 작은 길이, 거의 직선에 가까운 호)
  noFill();
  stroke(80, 120, 160);
  strokeWeight(2);
  arc(300, 155, 140, 25, 0.05, PI - 0.05);

   // ===== 팔  =====
  fill(160, 220, 255);
  stroke(90, 160, 200);
  strokeWeight(2);

  // 왼팔 (↘ 방향, 몸통 왼쪽에서 중앙으로 내려옴)
  ellipse(260, 240, 36, 65);

  // 오른팔 (↙ 방향, 몸통 오른쪽에서 중앙으로 내려옴)
  ellipse(340, 240, 36, 65);

  // ===== 손가락 =====
  stroke(70, 120, 160);
  strokeWeight(3)

  // 왼손 손가락 (중앙쪽을 향해)
  line(255, 260, 255, 270);
  line(265, 260, 265, 270);

  // 오른손 손가락 (중앙쪽을 향해)
  line(335, 260, 335, 270);
  line(345, 260, 345, 270);


  // ===== 발 =====
  fill(160, 220, 255); stroke(90, 160, 200); strokeWeight(1);
  ellipse(250, 350, 55, 30);
  ellipse(350, 350, 55, 30);
  stroke(70, 120, 160); strokeWeight(3);
  
  // 왼발 발가락
  line(230, 360, 240, 350);
  line(243, 364, 253, 354);
  
  // 오른발 발가락
  line(343, 354, 353, 364);
  line(357, 350, 367, 360);

  // ===== 꼬리 (rotate로 오른쪽 위 방향) =====

  translate(380, 280);  // 꼬리 붙을 위치로 이동
  rotate(-PI/4);        // 반시계(-) 방향으로 회전 = 오른쪽 위로 기울기
  fill(160, 220, 255);
  stroke(90, 160, 200);
  strokeWeight();
  ellipse(30, 20, 150, 65);  // 꼬리 타원
 

  
  // ===== 좌표 주석 =====
  stroke(255, 140);
  noStroke(); fill(255); textSize(12);
  
}
